<img src='./img/intel-logo.jpg' width=50%, Fig1> 

# 판다스 기초강의
<font size=5><b>07.통계와 정렬<b></font>

<div align='right'>성  민  석 (Minsuk  Sung)</div>
<div align='right'>류  회  성 (Hoesung Ryu)</div>

<img src='./img/pandas-logo.png' width=50%, Fig2> 


---

<h1>강의목차<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#주요-통계-함수-목록과-옵션" data-toc-modified-id="주요-통계-함수-목록과-옵션-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>주요 통계 함수 목록과 옵션</a></span><ul class="toc-item"><li><span><a href="#Describe()" data-toc-modified-id="Describe()-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Describe()</a></span></li><li><span><a href="#count()" data-toc-modified-id="count()-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>count()</a></span></li><li><span><a href="#sum()" data-toc-modified-id="sum()-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>sum()</a></span></li><li><span><a href="#mean()" data-toc-modified-id="mean()-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>mean()</a></span></li></ul></li><li><span><a href="#정렬" data-toc-modified-id="정렬-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>정렬</a></span><ul class="toc-item"><li><span><a href="#Series-정렬" data-toc-modified-id="Series-정렬-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Series 정렬</a></span><ul class="toc-item"><li><span><a href="#로우-인덱스-라벨의-값으로-정렬" data-toc-modified-id="로우-인덱스-라벨의-값으로-정렬-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>로우 인덱스 라벨의 값으로 정렬</a></span></li><li><span><a href="#Series의-값으로-정렬-(기본값-=-오름차순)" data-toc-modified-id="Series의-값으로-정렬-(기본값-=-오름차순)-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Series의 값으로 정렬 (기본값 = 오름차순)</a></span></li><li><span><a href="#Series의-값으로-내림차순-정렬" data-toc-modified-id="Series의-값으로-내림차순-정렬-2.1.3"><span class="toc-item-num">2.1.3&nbsp;&nbsp;</span>Series의 값으로 내림차순 정렬</a></span></li></ul></li><li><span><a href="#DataFrame정렬" data-toc-modified-id="DataFrame정렬-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>DataFrame정렬</a></span><ul class="toc-item"><li><span><a href="#수학성적으로-오름차순-정렬" data-toc-modified-id="수학성적으로-오름차순-정렬-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>수학성적으로 오름차순 정렬</a></span></li><li><span><a href="#영어-성적으로-내림차순-정렬" data-toc-modified-id="영어-성적으로-내림차순-정렬-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>영어 성적으로 내림차순 정렬</a></span></li><li><span><a href="#2개-이상의-컬럼으로-정렬" data-toc-modified-id="2개-이상의-컬럼으로-정렬-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>2개 이상의 컬럼으로 정렬</a></span></li><li><span><a href="#2017년-수학-성적-기준으로-내림차순-정렬" data-toc-modified-id="2017년-수학-성적-기준으로-내림차순-정렬-2.2.4"><span class="toc-item-num">2.2.4&nbsp;&nbsp;</span>2017년 수학 성적 기준으로 내림차순 정렬</a></span></li></ul></li></ul></li></ul></div>

## 주요 통계 함수 목록과 옵션 

<img src='./img/statistic_summary.png' width=90%, Fig2>

In [3]:
import pandas as pd 
import numpy as np
# 샘플 데이터 생성
np.random.seed(0)
df = pd.DataFrame(np.random.randint(50, 100, (5, 4)), 
                  columns=[[2016, 2016, 2017, 2017], ['영어','수학','영어','수학']], index = ['Kim','Park','Lee','Jung','Moon'])
df

     2016     2017
       영어  수학   영어  수학
Kim    94  97   50  53
Park   53  89   59  69
Lee    71  86   73  56
Jung   74  74   62  51
Moon   88  89   73  96

### Describe()

In [4]:
df.describe()

            2016                  2017
              영어         수학         영어         수학
count   5.000000   5.000000   5.000000   5.000000
mean   76.000000  87.000000  63.400000  65.000000
std    16.015617   8.336666   9.813256  18.694919
min    53.000000  74.000000  50.000000  51.000000
25%    71.000000  86.000000  59.000000  53.000000
50%    74.000000  89.000000  62.000000  56.000000
75%    88.000000  89.000000  73.000000  69.000000
max    94.000000  97.000000  73.000000  96.000000

In [11]:
# 전체의 type 을 살펴볼수있다. 
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Kim to Moon
Data columns (total 4 columns):
(2016, 영어)    5 non-null int64
(2016, 수학)    5 non-null int64
(2017, 영어)    5 non-null int64
(2017, 수학)    5 non-null int64
dtypes: int64(4)
memory usage: 360.0+ bytes

### count()
NaN 값을 제외한 데이터의 갯수

In [6]:
df.count()

2016  영어    5
      수학    5
2017  영어    5
      수학    5
dtype: int64

### sum() 
값의 합을 계산

In [7]:
df.sum()

2016  영어    380
      수학    435
2017  영어    317
      수학    325
dtype: int64

### mean()
평균구하기

In [9]:
df.mean(axis=1)

Kim     73.50
Park    67.50
Lee     71.50
Jung    65.25
Moon    86.50
dtype: float64

## 정렬

<img src='./img/sort.png' width=90%, Fig2>

### Series 정렬

In [14]:
# Series 정렬을 위한 샘플 데이터
sr = pd.Series([3,5,2,1,7,10], index = list('bcafed'))
sr

b     3
c     5
a     2
f     1
e     7
d    10
dtype: int64

####  로우 인덱스 라벨의 값으로 정렬

In [16]:
sr.sort_index()

a     2
b     3
c     5
d    10
e     7
f     1
dtype: int64

#### Series의 값으로 정렬 (기본값 = 오름차순)

In [17]:
sr.sort_values()

f     1
a     2
b     3
c     5
e     7
d    10
dtype: int64

#### Series의 값으로 내림차순 정렬

In [18]:
sr.sort_values(ascending=False)

d    10
e     7
c     5
b     3
a     2
f     1
dtype: int64

### DataFrame정렬

In [20]:
df2016 = df[2016]
df2016

      영어  수학
Kim   94  97
Park  53  89
Lee   71  86
Jung  74  74
Moon  88  89

#### 수학성적으로 오름차순 정렬

In [21]:
df2016.sort_values(by='수학') # by 를 이용해서 정렬하고자 하는 컬럼

      영어  수학
Jung  74  74
Lee   71  86
Park  53  89
Moon  88  89
Kim   94  97

#### 영어 성적으로 내림차순 정렬

In [28]:
df2016.sort_values(by='영어',ascending=False) # by 를 이용해서 정렬하고자 하는 컬럼

      영어  수학
Kim   94  97
Moon  88  89
Jung  74  74
Lee   71  86
Park  53  89

#### 2개 이상의 컬럼으로 정렬

In [29]:
# 수학 성적으로 내림차순 정렬하되,
# 수학 성적이 같으면 영어성적으로 내림차순 정렬
df2016.sort_values(by=['수학','영어'],ascending=False)

      영어  수학
Kim   94  97
Moon  88  89
Park  53  89
Lee   71  86
Jung  74  74

In [30]:
df2016.sort_values(by=['수학','영어'],ascending=[False,True])

      영어  수학
Kim   94  97
Park  53  89
Moon  88  89
Lee   71  86
Jung  74  74

#### 2017년 수학 성적 기준으로 내림차순 정렬

In [26]:
df

     2016     2017
       영어  수학   영어  수학
Kim    94  97   50  53
Park   53  89   59  69
Lee    71  86   73  56
Jung   74  74   62  51
Moon   88  89   73  96

In [27]:
df.sort_values(by=(2017,'수학'),ascending=False)

     2016     2017
       영어  수학   영어  수학
Moon   88  89   73  96
Park   53  89   59  69
Lee    71  86   73  56
Kim    94  97   50  53
Jung   74  74   62  51